(CNN) The NBA All-Star Game is around the corner, and there is no shortage of story lines leading up to the 66th playing of this game.

For starters, the location. Originally, this year's game was scheduled to be in Charlotte, North Carolina. But because of the state's controversial transgender bathroom law, the NBA moved the event to the Smoothie King Center -- home of the New Orleans Pelicans.

For updates, stories, video and features about the NBA playoffs go to cnn.com/nba

This will be the third time New Orleans has hosted the All-Star Game.

In July, the NBA said it hopes to hold the 2019 game in Charlotte "provided there is an appropriate resolution to this matter."

Another talking point is who got voted in, because this year was the first time NBA players and basketball media joined fans in voting for the starters.

Photos: NBA All-Star superlatives Russell Westbrook throws down a dunk during the 2016 NBA All-Star Game. He was the Most Valuable Player in what was the highest-scoring All-Star Game of all time. The two teams combined for 369 points as the Western Conference won 196-173. Hide Caption 1 of 10 Photos: NBA All-Star superlatives First All-Star MVP: Ed Macauley, left, was MVP of the first NBA All-Star Game, which was played in 1951. Boston teammate Bob Cousy, right, was also on the team that year. Between them here is Walter Brown, the Celtics' original owner. Hide Caption 2 of 10 Photos: NBA All-Star superlatives Most appearances as a player: Hall of Fame center Kareem Abdul-Jabbar was named to 19 All-Star teams during his career, and he played in 18 of the games. Hide Caption 3 of 10 Photos: NBA All-Star superlatives Most MVP awards: Bob Pettit, left, and Kobe Bryant each won four All-Star MVP awards during their career. Both also shared one of their awards -- Pettit split with Elgin Baylor in 1959, and Bryant shared the spoils with former teammate Shaquille O'Neal in 2009. Hide Caption 4 of 10 Photos: NBA All-Star superlatives Largest attendance: In 2010, there were 108,713 fans who attended the game at Cowboys Stadium in Arlington, Texas. Hide Caption 5 of 10 Photos: NBA All-Star superlatives Most points in a game: Philadelphia center Wilt Chamberlain scored 42 points in the 1962 All-Star Game. Two months later, he set the league's all-time scoring record by putting up 100 against the New York Knicks. Hide Caption 6 of 10 Photos: NBA All-Star superlatives Triple-doubles: Michael Jordan dunks the ball during the 1997 All-Star Game in Cleveland. He finished with 14 points, 11 rebounds and 11 assists for the first triple-double in All-Star history. Only two other players have accomplished the feat: LeBron James in 2011 and Dwayne Wade in 2012. Hide Caption 7 of 10 Photos: NBA All-Star superlatives Most All-Stars from one team: This year, for the eighth time in NBA history, four players from one team will be on the All-Star team. The four players this year are from the Golden State Warriors: from left, Klay Thompson, Kevin Durant, Draymond Green and Stephen Curry. Hide Caption 8 of 10 Photos: NBA All-Star superlatives Youngest MVP: James was just 21 years (and 51 days) old when he was named All-Star MVP in 2006. He added a second MVP trophy in 2008. Hide Caption 9 of 10 Photos: NBA All-Star superlatives Most wins: The Eastern Conference has a 37-28 record in the All-Star Game, but the Western Conference is catching up. The West has won five of the past six. Hide Caption 10 of 10

The fan vote made up 50% while the current players and a panel of basketball media counted as 25% each. Previously, only fans voted for the starters for the Eastern and Western Conference teams.

With that in mind, here is a look at the All-Star Game starting lineups:

Eastern Conference Starters:

Giannis Antetokounmpo, Milwaukee Bucks

Jimmy Butler, Chicago Bulls

DeMar DeRozan, Toronto Raptors

Kyrie Irving, Cleveland Cavaliers

LeBron James, Cleveland Cavaliers

Western Conference Starters:

Stephen Curry, Golden State Warriors

Anthony Davis, New Orleans Pelicans

Kevin Durant, Golden State Warriors

James Harden, Houston Rockets

Kawhi Leonard, San Antonio Spurs

Uh, someone's missing

At a quick glance, this looks pretty good, right? But there is a glaring omission.

Oklahoma City Thunder point guard Russell Westbrook is averaging a triple double (recording on average double digits in points, rebounds and assists per game). The only player to ever do that through an entire season is Hall-of-Famer Oscar Robertson in 1961-62.

Despite averaging a triple double and leading the NBA in scoring, Thunder point guard Russell Westbrook wasn't voted in as a starter.

But despite the feat, Westbrook, who also leads the NBA in scoring, didn't garner enough votes to start. Fans ranked Westbrook third out of the Western Conference guards, while the media and players each ranked him first.

"It is what it is," Westbrook said in January after the results came out. "That's the nature of the business, the game. I just play. I don't play for All-Star bids. I play to win championships, and every night I compete at a high level, and it'll work out.

"I just continue doing what I'm doing and play the game the right way, and everything else will work out."

While he's not starting, Westbrook is one of the reserves , who were selected by NBA head coaches. Here's that list:

Eastern Conference All-Star Reserves

Paul George, Indiana Pacers

Carmelo Anthony, New York Knicks*

Kyle Lowry, Toronto Raptors

Paul Millsap, Atlanta Hawks

Isaiah Thomas, Boston Celtics

Kemba Walker, Charlotte Hornets

John Wall, Washington Wizards

*Anthony replaces Kevin Love of the Cleveland Cavaliers, who is injured. Reserve replacements are picked by NBA Commissioner Adam Silver.

Western Conference All-Star Reserves

DeMarcus Cousins, Sacramento Kings

Marc Gasol, Memphis Grizzlies

Draymond Green, Golden State Warriors

Gordon Hayward, Utah Jazz

DeAndre Jordan, Los Angeles Clippers

Klay Thompson, Golden State Warriors

Russell Westbrook, Oklahoma City Thunder

The last time the Warriors faced the Thunder, cameras caught them jawing at each other during a timeout. Which leads to another tantalizing angle. Westbrook will be on the same team as Durant, who left the Thunder for the loaded Warriors in free agency. Durant's breakup with Oklahoma City -- and Westbrook -- did not go over well.The last time the Warriors faced the Thunder, cameras caught them jawing at each other during a timeout.

Will they be on the floor together Sunday? That will be up to Warriors head coach Steve Kerr and his staff, who will coach the Western Conference.

Once Thunder teammates, Warriors forward Kevin Durant and Westbrook now play against each other. Sunday, they'll be Western Conference All-Star teammates.

Meanwhile, because Cavaliers head coach Tyronn Lue coached the Eastern Conference All-Stars last season, he is ineligible to coach them this year. Instead, Celtics head coach Brad Stevens and his staff will handle the coaching duties.

Don't forget the "Greek Freak"

That Durant-Westbrook drama notwithstanding, there's a chance that a first-time All-Star could steal the show.

The 22-year-old Antetokounmpo, who was born in Athens, Greece (his parents immigrated there from Nigeria), plays for a Milwaukee team that may not reach the playoffs. Still, he has made the Bucks a must watch.

Milwaukee Bucks point guard Giannis Antetokounmpo.

The "Greek Freak" is unlike anyone the league has seen before. Antetokounmpo, who is 6 feet, 11 inches with a reported 7-foot-3-inch wingspan , is a point guard, unheard of for someone that height playing that position. The person responsible for putting him there is Bucks head coach Jason Kidd -- a former 6-foot-4-inch point guard himself.

The way Antetokounmpo glides down the court with those giant strides and attacks the rim at times is breathtaking . So are his stats. Through Sunday, Antetokounmpo leads the Bucks in points, rebounds, assists, steals and blocks.

"This is a great honor for Giannis and a testament to his work ethic and commitment to his craft," Kidd said when Antetokounmpo was announced as a starter last month. "I know Giannis will cherish this opportunity to not just showcase his game, but to play alongside and learn from the league's best."

But can Antetokounmpo help the East win? The West has won the All-Star Game the last two seasons. The MVP both times: Westbrook.

Get the popcorn ready.